shalaev.org
*** "System" emacs functions
#+BEGIN_SRC emacs-lisp :tangle generated/local-packages.el
(unless (functionp 'caddr) (defun caddr(x) (car(cddr x)))); for emacs versions <26
(unless (functionp 'cadar) (defun cadar(x) (car (cdar x))))

(defun emacs-ver()
  (mapcar #'string-to-number (split-string
   (caddr (split-string (emacs-version))) "\\.")))
#+END_SRC

Let us upgrade =upgrade-make-temp-file= on older emacs versions, allowing this novel ~TEXT~ argument:
#+BEGIN_SRC emacs-lisp :tangle generated/local-packages.el
(unless (< 25 (car (emacs-ver)))
  (defun upgrade-make-temp-file(old-function PREFIX &optional DIR-FLAG SUFFIX TEXT)
    (let((FN (funcall old-function PREFIX DIR-FLAG SUFFIX)))
      (when (and TEXT (stringp TEXT))
      (write-region TEXT nil FN))
    FN))
(add-function :around (symbol-function 'make-temp-file) #'upgrade-make-temp-file))
#+END_SRC
← otherwise my =make-temp-file= code *fails* on emacs version 25.1.1 (but works on 26.1).

*** creating PID file
Before launching emacs server in my [[file:.login][~/.login]] file, I check PID file created by
#+BEGIN_SRC emacs-lisp :tangle generated/dot.emacs :shebang ";; -*-  lexical-binding: t; -*-"
;;
;; see https://github.com/chalaev/lisp-goodies/blob/master/packaged/batch-start.el
(load-file "/path-to/batch-start.el")

;; creating PID file for emacs; useful when it gets started from ~/.login
;; see https://github.com/chalaev/lisp-goodies/blob/master/.login
(make-temp-file "emacs-" nil ".pid" (format "%d
" (emacs-pid))); requires version(emacs) > 26
#+END_SRC

*** Placing/Finding local packages
The following 3 blocks allow me to require simple (consisting of one file) locally created packages, for example, this one – =(require 'shalaev)=;

Defining important directories:
#+BEGIN_SRC emacs-lisp :tangle generated/local-packages.el :shebang ";; -*-  lexical-binding: t; -*-"
(defvar HOME (getenv "HOME"))
(defvar ~ (file-name-as-directory HOME))
(defun ~() (file-name-as-directory HOME))
(defun   tilde(x) (replace-regexp-in-string (concat "^" ~) "~/" x))
(defun untilde(x) (replace-regexp-in-string "^~/" ~ x))
(defvar emacs-d (concat "~/" (file-name-as-directory ".emacs.d")))
#+END_SRC

Inform ~emacs~ about new directory =~/.emacs.d/local-packages/= containing package files
(and create it if necessary):
#+BEGIN_SRC emacs-lisp :tangle generated/local-packages.el
(require 'package)
(unless (assoc "local-packages" package-archives)
  (push (cons  "local-packages" (concat emacs-d (file-name-as-directory "local-packages")))
	package-archives))
(make-directory (cdr (assoc "local-packages" package-archives)) t)
#+END_SRC

Adjusting [[https://www.emacswiki.org/emacs/LoadPath][load-path]]:
#+BEGIN_SRC emacs-lisp :tangle generated/local-packages.el
(unless (member (cdr (assoc "local-packages" package-archives)) load-path)
  (add-to-list 'load-path (cdr (assoc "local-packages" package-archives))))
#+END_SRC


*** for using in Makefiles
My [[https://github.com/chalaev/backup2l.conf][backup]] system does not save files having the group ~tmp~.
I use this group to mark all generated (tangled) files:
#+BEGIN_SRC emacs-lisp :tangle generated/make.el
(require 'shalaev) ; ← needed for perms-from-str unless you have loaded it in another way
(defun after-tangle()
  "mark tangled files as non-backupable (chgrp tmp files) and non-excecutable"
  (let ((FN (buffer-file-name)))
#+END_SRC
The following line is equivalent to =chmod a-x FN=:
#+BEGIN_SRC emacs-lisp :tangle generated/make.el
    (set-file-modes FN (logand #o666 (perms-from-str (nth 8 (file-attributes FN 'string)))))
    (chgrp "tmp" FN)))
(add-hook 'org-babel-post-tangle-hook #'after-tangle)
#+END_SRC
so they are not backuped.

My literate programming relies on rmacs or mode and its =M-x org-babel-tangle= command, which I want to output the names of the generated files.
So in [[file:Makefile][Makefiles]] I often use ~printangle~ [it returns the list of exported (tangled) files]:
#+BEGIN_SRC emacs-lisp :tangle generated/make.el
(defun printangle(FN)
  "to be used in Makefile instead of org-babel-tangle-file"
  (let ((l (length default-directory)))
    (apply #'concat (mapcar #'(lambda(x) (substring (format "%s " x) l)) (org-babel-tangle-file FN)))))
#+END_SRC
← my [[https://github.com/chalaev/cl-simple-logger/blob/master/Makefile][Makefile]]s load its definition from [[file:helpers/derive-version.el][derive-version.el]].

*** Other stuff
(found online) =run-init-block=  runs ~init~ code block when loading an org-file:
#+BEGIN_SRC emacs-lisp :tangle generated/make.el
(defun run-init-block ()
"runs code block labeled 'init' when an org-file is opened in emacs"
  (org-babel-goto-named-src-block "init")
  (org-babel-execute-src-block))
#+END_SRC

** replacing cl.el
Just following Stallman's advice, I try to avoid using =cl.el=;
=generated/cl.el= will be my (incomplete for now) replacement for  =cl.el=
to be loaded as follows:
#+BEGIN_SRC emacs-lisp
(unless (functionp 's-gensym)
  (load (concat (file-name-as-directory "generated") "cl.el")))
#+END_SRC

*Problem:* I am not sure if eliminating =cl.el= really makes sence because
apparently it is widely used; for example, =M-x org-babel-tangle= uses =cl.el= (although does not require it).

*** s-gensym
#+BEGIN_SRC emacs-lisp :tangle generated/cl.el :shebang ";; -*-  lexical-binding: t; -*-"
(let ((counter 0))
  (defun s-gensym(&optional starts-with)
    "for those who miss s-gensym from Common Lisp"
    (unless starts-with (setf starts-with "gs"))
    (let (sym)
      (while (progn
               (setf sym (make-symbol (concat starts-with (number-to-string counter))))
               (or (special-form-p sym) (functionp sym) (macrop sym) (boundp sym)))
        (s-incf counter))
      (s-incf counter)
      sym)))
#+END_SRC
=s-gensym= is used in macros, e.g.
#+BEGIN_SRC emacs-lisp :results drawer
(let ((ms (s-gensym "a")))
  `(let ((,ms 0))
     (1+ ,ms)))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((a3 0)) (1+ a3))
:END:

*** s-find
~s-find~ stands for "shalaev-find"; note that it is *not* compatible with ~find~ from ~cl.el~:
#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(defun s-find(item seq &optional key test)
  (let ((CS(car seq)) found (test (or test 
(cond
  ((stringp item) #'string=)
  ((numberp item) #'=)
  (t #'eq)))))
  (while
     (and
       (not (setf found (funcall test item (if key (funcall key CS) CS))))
       (setf seq (cdr seq)))
     (setf CS(car seq)))
     (when found CS)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest s-find.1()
  (should (equal '(3 4) (s-find 4 '((1 2) (3 4) (5 6)) #'cadr)))
  (should (= 3 (s-find 3 '(1 2 3 4 5))))
(let ((cumbersome-list '(141 142 143 144)))
  (should (= (s-find (* 12 12) cumbersome-list nil #'=) 144))
  (should (= (s-find (/ 144 2) cumbersome-list nil #'(lambda(x y) (= (* 2 x) y))) 144))
  (should (= (s-find 12 cumbersome-list nil #'(lambda(x y) (= (* x x) y))) 144)))
(let ((cumbersome-list '((141 142) (143 144))))
  (should (equal (s-find 12 cumbersome-list #'cadr #'(lambda(x y) (= y (* x x)))) '(143 144)))))
(ert-deftest s-find.2()
"this code comes from cloud project"
(let((plain(lambda(FR)(aref FR 0))) (cipher(lambda(FR)(aref FR 6)))
    (file-DB(list
  ["/home/user/proj/chat/chat.org" "shalaev" "shalaev" (24559 50916 0 0) 48756 420 "U3j"]
  ["~/proj/lisp-goodies/shalaev.org" "shalaev" "shalaev" (24552 57834 0 0) 432 61533 "Q8T"])))
(should(string= "/home/user/proj/chat/chat.org"   (funcall plain (s-find "U3j" file-DB cipher #'string=))))
(should(string= "~/proj/lisp-goodies/shalaev.org" (funcall plain (s-find "Q8T" file-DB cipher #'string=))))))
#+END_SRC

Note the difference from ~find~ defined in ~cl.el~: instead of
#+BEGIN_SRC emacs-lisp
(let ((cumbersome-list '((141 142) (143 144) (145 146))))
  (find 12 cumbersome-list :key #'cadr :test #'(lambda(x y) (= y (* x x)))))
#+END_SRC
we write
#+BEGIN_SRC emacs-lisp
(let ((cumbersome-list '((141 142) (143 144) (145 146))))
  (s-find 12 cumbersome-list #'cadr #'(lambda(x y) (= y (* x x)))))
#+END_SRC

*** s-decf and s-incf
#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(defmacro s-decf (var &optional amount)
  (unless amount (setf amount 1))
  `(setf ,var (- ,var ,amount)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(defmacro s-incf (var &optional amount)
  (unless amount (setf amount 1))
  `(setf ,var (+ ,var ,amount)))
#+END_SRC

*** lett (replacing flet + let)
#+BEGIN_SRC emacs-lisp :tangle generated/cl.el
(defmacro lett(var-defs &rest body)
"let where one can define (usual) local variables as well as local functions"
  (if(car var-defs)
      (let((ME (macroexpand-1 `(lett ,(cdr var-defs) ,@body))))
      (if(and(listp (car var-defs))(eql 'defun (caar var-defs)))
	  (let((func-data (cdar var-defs)))
	    `(let((,(car func-data) (lambda ,(cadr func-data) ,@(cddr func-data))))
	        ,ME))
	`(let(,(car var-defs)) ,ME)))
    `(progn ,@body)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest lett()
(should(eval(let((fName(s-gensym)))
`(lett(z (a 2) (defun ,fName(x)(1+ x)) w)
 (functionp ,fName)))))

(should(not(let((fName(s-gensym)))
(functionp fName))))

(let((fName(s-gensym)))
(should(not(or (special-form-p fName) (functionp fName) (macrop fName) (boundp fName)))))

(should (= 6 (lett(z (a 2) (defun sw(x)(1+ x)) w)
  (unless (or z w)
    (setf z (funcall sw a))
    (* z a))))))
#+END_SRC

*** select, without, and drop
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el :shebang ";; -*-  lexical-binding: t; -*-"
(defun select (from-where match-test)
  "select items matching the test"
    (let (collected wasted)
       (dolist (list-item from-where)
	 (if (funcall match-test list-item)
	   (push list-item collected)
	   (push list-item wasted)))
(cons (reverse collected) (reverse wasted))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest select()
(let ((test-list  '(4 22 11 33 12 24 77)))
  (should (not (car (select test-list #'zerop))))
  (should (equal '(11 33 77) (car (select test-list #'oddp))))
  (should (equal '(4 22 12 24) (car (select test-list #'evenp))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun without(source &rest wrong-items)
  "returns (copy of) source without wrong-items"
  (car (select source #'(lambda(x) (not (member x wrong-items))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest without()
(let ((test-list  '(4 22 11 33 12 24 77)))
  (should (equal '(4 22 11 33 77) (without test-list 12 24)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro drop (from-where &rest what)
`(setf ,from-where (without ,from-where ,@what)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest drop()
(let ((test-list  '(4 22 11 33 12 24 77)))
  (drop test-list 12 24)
  (should (equal '(4 22 11 33 77) test-list))))
#+END_SRC

*** define-vars
The whole point of =define-vars= is to make it easy to switch between ~(let ...)~
and ~(defvar ...)~ so may be later I should redefine it as =(defmacro define-vars (varDefs &rest body)=:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro define-vars (varDefs)
  "to make switching between local/global variables easier"
(cons 'progn
(mapcar #'(lambda(VD)
  (if (consp VD)
      `(defvar ,@VD)
      `(defvar ,VD nil)))
varDefs)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests.el
(ert-deftest define-vars()
(should(string= "(progn (defvar a nil) (defvar b nil))" (string-from-macro '(define-vars (a b)))))
(should(string= "(progn (defvar a 1) (defvar b nil) (defvar c 2))" (string-from-macro '(define-vars ((a 1) b (c 2)))))))
#+END_SRC

*** to do
reduce, …

** short pieces of code
*** case*
~case*~ is not identical to =case= from =cl.el=:
it uses arbitrary test function:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro case* (expr test &rest cases)
  "case with arbitrary test function"
  (let ((v (s-gensym "v")))
    `(let ((,v ,expr))
       (cond
        ,@(mapcar #'(lambda (VR)
(let ((val (car VR)) (rest (cdr VR)))
  (if (eql val 'otherwise)
      `(t ,@rest)
    `((,test ,v ,val) ,@rest))))
 cases)))))
#+END_SRC
A simple example:
#+BEGIN_SRC emacs-lisp :results drawer
(macroexpand-1 
 `(case* (+ 1 2) =
    (choice-1 (message "choice-1"))
    (choice-2 (message "choice-2"))
    (otherwise (message "no match"))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((v13 (+ 1 2)))
 (cond 
((= v13 choice-1) (message choice-1))
((= v13 choice-2) (message choice-2))
(t (message no match))))
:END:

Another example is also self-explanatory:
#+BEGIN_SRC emacs-lisp :results drawer
(let ((x 32) (choice-1 22)  (choice-2 33))
  (case* (1+ x) =
    (choice-1 (message "choice-1"))
    (choice-2 (message "choice-2"))
    (otherwise (message "no match"))))
#+END_SRC

#+RESULTS:
:RESULTS:
choice-2
:END:

*** case-let
=case-let= is probably *useless*:
as of 2020-11-04 I think that small convenience due to slight code size reduction does not compensate new symbol introduction, so =case-let= remains unused for now.

Sometimes we may want to access the let-variable name generated in =case*=;
so we define =case-let= which is only a slightly modified version of =case*=:
#+BEGIN_SRC emacs-lisp
(defmacro case-let (let-var expr test &rest cases)
  "case* with let expriable named by the user"
    `(let ((,let-var ,expr))
       (cond
        ,@(mapcar #'(lambda (VR)
(let ((val (car VR)) (rest (cdr VR)))
  (if (eql val 'otherwise)
      `(t ,@rest)
    `((,test ,let-var ,val) ,@rest))))
 cases))))
#+END_SRC
A simple example:
#+BEGIN_SRC emacs-lisp :results drawer
(macroexpand-1 
 `(case-let x (+ 1 2) =
    (choice-1 (format "1: x=%d" x))
    (choice-1 (format "2: x=%d" x))
    (otherwise (message "no match"))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((x (+ 1 2))) (cond ((= x choice-1) (format 1: x=%d x)) ((= x choice-1) (format 2: x=%d x)) (t (message no match))))
:END:

*** when-set and unless-set
Sometimes instead of =when-let= I use somewhat similar =when-set= macro.
=when-set= is similar to =when-let= except for that it uses existing global variables instead of creating local ones.

#+begin_note
Global variable values will *not* be set to ~nil~.
#+end_note

#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro when-set (vars &rest body)
  "when-let using global variable instead of defining local one"
(let ((GV (s-gensym)))
  `(let ((,GV ,(cadar vars)))
     ,(if (cdr vars)
	  `(when ,GV
              (setf ,(caar vars) ,GV)
	     ,(macroexpand-1 `(when-set ,(cdr vars) ,@body)))
	(append `(when ,GV (setf ,(caar vars) ,GV)) body)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1
 `(when-set ((CN (clouded (aref newDBrec cipher))) (NFE (not (file-exists-p CN))))
    (+ 1 2)
    (- 1 2))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((it15 (clouded (aref newDBrec cipher))))
 (when it15 (setf CN it15) 
   (let ((it16 (not (file-exists-p CN))))
      (when it16 (setf NFE it16) (+ 1 2) (- 1 2)))))
:END:

=unless-set= is similar to =when-set=:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro unless-set (vars &rest body)
  "unless-let using global variable instead of defining local one"
(let ((GV (s-gensym)))
  `(let ((,GV ,(cadar vars)))
     ,(if (cdr vars)
	  `(if ,GV
              (setf ,(caar vars) ,GV)
	     ,(macroexpand-1 `(unless-set ,(cdr vars) ,@body)))
	(append `(if ,GV (setf ,(caar vars) ,GV)) body)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1
 `(unless-set ((CN (aref newDBrec cipher)) (FE (file-exists-p CN)))
    (+ 1 2)
    (- 1 2))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((g30 (aref newDBrec cipher)))
  (if g30
     (setf CN g30) 
(let ((g31 (file-exists-p CN)))
    (if g31 (setf FE g31)
       (+ 1 2)
       (- 1 2)))))
:END:

