shalaev.org
** load*
Preventing multiple load of the seame file:
#+BEGIN_SRC emacs-lisp :tangle generated/load.el
(defun barename (FN)
  (let ((SS (split-string (file-name-nondirectory FN)  "\\." t)))
    (mapconcat #'(lambda(x)x) (butlast SS) ".")))
#+END_SRC

The following function is designed to prevent multiple evaluation of one and the same file:
#+BEGIN_SRC emacs-lisp :tangle generated/load.el
(let (loaded); prevents duplicate evaluation of files
(defun load* (x &optional el-prefix)
  (let ((FN (tilde (file-chase-links (concat (or el-prefix "~/") x)))))
    (unless (member (car (last (split-string FN "\\." t))) '("el" "elc"))
      (setf FN (concat FN ".el")))
    (unless (member FN loaded) (load-file FN) (push (barename FN) loaded)))))
#+END_SRC

Usage example:
#+BEGIN_SRC emacs-lisp
(mapcar #'(lambda(x) (load* x "~/programming/"))
	'("macros" "functions" "logging"  ....))
#+END_SRC

* common lisp
** iff
#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro iff (test-form then &rest else)
  "elisp-kind of if"
  (if (cdr else)
      `(if ,test-form ,then (progn ,@else))
      (if (car else)
	  `(if ,test-form ,then ,@else)
	  `(when ,test-form ,then))))
#+END_SRC

#+BEGIN_SRC lisp :results drawer
(macroexpand-1 '(iff 1 2))
#+END_SRC

#+RESULTS:
:RESULTS:
(WHEN 1 2)
T
:END:

#+BEGIN_SRC lisp :results drawer
(macroexpand-1 '(iff 1 2 3))
#+END_SRC

#+RESULTS:
:RESULTS:
(IF 1
    2
    3)
T
:END:

#+BEGIN_SRC lisp :results drawer
(macroexpand-1 '(iff 1 2 3 4))
#+END_SRC

#+RESULTS:
:RESULTS:
(IF 1
    2
    (PROGN 3 4))
T
:END:

** simple stuff
#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro ifn (test ifnot &rest ifyes)
`(iff (not ,test) ,ifnot ,@ifyes))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro concat (&rest strs)
  `(concatenate 'string ,@strs))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest concat
  (concat "/etc/" "dqoE.tmp")
"/etc/dqoE.tmp")
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro aset(arr pos val)
  `(setf (aref ,arr ,pos) ,val))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest aset
(aref
(let ((container (make-array 5)))
  (aset container 2 23987)
  container)
2)
23987)
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/macros.lisp
(defmacro hset(arr pos val)
  `(setf (gethash ,pos ,arr) ,val))
#+END_SRC

#+BEGIN_SRC lisp :tangle generated/tests.lisp
(deftest hset
(gethash 'one-entry
(let ((container (make-hash-table)))
  (hset container 'one-entry 23987)
  container))
23987 t)
#+END_SRC

** file/directory fuctions
*** rmdir
#+BEGIN_SRC lisp :tangle generated/files.lisp
(defun rmdir(DN)
  (handler-case (cons t (sb-posix:rmdir DN))
    (sb-posix:syscall-error (c)
    (cons nil
      (case (sb-posix:syscall-errno c)
        (13 :permission)
        (2 :absent)
        (39 :occupied)
        (otherwise (cons :unknown (sb-posix:syscall-errno c))))))))
#+END_SRC
– expected to work on SBCL only.

*** echo-to-file
#+BEGIN_SRC lisp :tangle generated/files.lisp
(defun echo-to-file (FN str)
  (with-open-file (stream FN
    :if-exists :overwrite
    :direction :output
    :if-does-not-exist :create)
(format stream "~a~%" str)))
#+END_SRC

*** merge-paths = generalized merge-pathnames
#+BEGIN_SRC lisp :tangle generated/files.lisp
(defun merge-paths(root-dir &rest sub-dirs)
  (reduce
   #'(lambda(DN FN) (merge-pathnames FN (uiop:ensure-directory-pathname DN)))
   sub-dirs
   :initial-value root-dir))
#+END_SRC
